Java-Projects/TestCXFWebService/WebContent/wsdl/specificpersonsoapmessagegenerator.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="SpecificPersonSOAPMessageGeneratorService" targetNamespace="http://service.test.pst.com/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://service.test.pst.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/">
  <wsdl:types>
    <schema xmlns="http://www.w3.org/2001/XMLSchema">
  <import namespace="http://service.test.pst.com/" schemaLocation="specificpersonsoapmessagegenerator_schema1.xsd"/>
</schema>
  </wsdl:types>
  <wsdl:message name="fetchSpecificPersonMessage">
    <wsdl:part name="parameters" element="tns:fetchSpecificPersonMessage">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="fetchSpecificPersonMessageResponse">
    <wsdl:part name="parameters" element="tns:fetchSpecificPersonMessageResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="SpecificPersonSOAPMessageGenerator">
    <wsdl:operation name="fetchSpecificPersonMessage">
      <wsdl:input name="fetchSpecificPersonMessage" message="tns:fetchSpecificPersonMessage">
    </wsdl:input>
      <wsdl:output name="fetchSpecificPersonMessageResponse" message="tns:fetchSpecificPersonMessageResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SpecificPersonSOAPMessageGeneratorServiceSoapBinding" type="tns:SpecificPersonSOAPMessageGenerator">
    <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="fetchSpecificPersonMessage">
      <soap12:operation soapAction="" style="document"/>
      <wsdl:input name="fetchSpecificPersonMessage">
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="fetchSpecificPersonMessageResponse">
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SpecificPersonSOAPMessageGeneratorService">
    <wsdl:port name="SpecificPersonSOAPMessageGeneratorPort" binding="tns:SpecificPersonSOAPMessageGeneratorServiceSoapBinding">
      <soap12:address location="http://localhost:8082/TestCXFWebService/services"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
